# coding=utf-8

DEGREE_NORMALIZE = {
    "高中": "高中",
    "大专": "专科",
    "专科": "专科",
    "associate": '专科',

    "本科": "本科",
    "bachelor": "本科",
    "学士": "本科",
    "undergraduate": "本科",

    "硕士": "学术型硕士",
    "master": "学术型硕士",
    "postgraduate": "学术型硕士",
    "硕士研究生": "学术型硕士",
    "博士": "学术型博士",
    "phd": "学术型博士",
    "博士研究生": "学术型博士",
    "博士后": "学术型博士",

    "研究生": "专业学位硕士",

    "mba": "MBA",
    "工商管理硕士": "MBA",
    "emba": "EMBA",
    "高级管理人员工商管理硕士": "EMBA",
    "mba/emba": "MBA",
    "mpa": "专业学位硕士",

    "大学在读": "本科",
    "本科在读": "本科",
    "硕士在读": "学术型硕士",
    "博士在读": "学术型博士",

    "小学": "初中",
    "初中": "初中",
    "中专": "中专",
    "中技": "中专",
}

DEGREE_RANKS = {'初中': -1,
                '中专': 0,
                '高中': 0,
                '专科': 1,
                '本科': 2,
                '专业学位硕士': 3,
                '学术型硕士': 4,
                '专业学位博士': 5,
                '学术型博士': 6}

DEGREE_NUMS = {'不限': -4,
               '小学': -3,
               '初中': -2,
               '中专': -1,
               '高中': 0,
               '专科': 8,
               '本科': 16,
               '硕士': 24,
               '专业学位硕士': 24,
               '学术型硕士': 28,
               'MBA': 29,
               'EMBA': 30,
               '专业学位博士': 32,
               '学术型博士': 36,
               '博士后': 40, }

MIN_DEGREE_NUM = DEGREE_NUMS['不限']

SIMPLE_DEGREES = {'学术型博士': '博士',
                  '学术型硕士': '硕士',
                  '专业学位硕士': '硕士'}
